# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

### Load Required Libraries

In [1]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [2]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="9Navya@sharma")
cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [3]:
connection=mysql.connector.connect(host="localhost",
                                  user="root",
                                  password="9Navya@sharma")
cursorObject=connection.cursor()
cursorObject.execute("CREATE DATABASE e_commerce")
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [4]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     password ="9Navya@sharma",
                                     database = 'e_commerce')
 
cursorObject = connection.cursor()
table_creation_query = """create table supplier(  SUPP_ID     int primary key,
                                                               SUPP_NAME   varchar(50),
                                                               SUPP_CITY   varchar(50),
                                                               SUPP_PHONE  varchar(10)
                                                               );
                          
                          create table customer (  CUS_ID      int not null,
                                                                CUS_NAME    varchar(20) null default null,
                                                                 CUS_PHONE   varchar(10),
                                                                 CUS_CITY    varchar(30) ,
                                                                 CUS_GENDER  char,
                                                                 primary key (CUS_ID)
                                                                 );

                          create table category ( CAT_ID      int not null,
                                                                 CAT_NAME    varchar(20) null default null,
                                                                 primary key (CAT_ID)
                                                                 );

                          create table product (
                                                                PRO_ID      int not null,
                                                                PRO_NAME    varchar(20) null default null,
                                                                PRO_DESC    varchar(60) null default null,
                                                                CAT_ID      int not null,
                                                                primary key (PRO_ID),
                                                                foreign key (CAT_ID) references category(CAT_ID)
                                                                );


                          create table product_details (
                                                                         PROD_ID     int not null,
                                                                         PRO_ID      int not null,
                                                                         SUPP_ID     int not null,
                                                                         PROD_PRICE  int not null,
                                                                         primary key (PROD_ID),
                                                                         foreign key (PRO_ID) references product(PRO_ID),
                                                                         foreign key (SUPP_ID) references supplier(SUPP_ID)
                                                                         );
  
                          create table `order` (
                                                                ORD_ID      int not null,
                                                                ORD_AMOUNT  int not null,
                                                                ORD_DATE    date,
                                                                CUS_ID      int not null,
                                                                PROD_ID     int not null,
                                                                primary key (ORD_ID),
                                                                foreign key (CUS_ID) references customer(CUS_ID),
                                                                foreign key (PROD_ID) references product_details(PROD_ID)
                                                                );

                          create table rating (
                                                               RAT_ID int not null,
                                                               CUS_ID int not null,
                                                               SUPP_ID int not null,
                                                               RAT_RATSTARS int not null,
                                                               primary key (RAT_ID),
                                                               foreign key (SUPP_ID) references supplier(SUPP_ID),
                                                               foreign key (CUS_ID) references customer(CUS_ID)
                                                               );"""
cursorObject.execute(table_creation_query)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [6]:
# insert into "supplier" table
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     password ="9Navya@sharma",
                                     database = 'e_commerce')
 
cursorObject = connection.cursor()
insert_supplier = """INSERT INTO supplier (SUPP_ID , SUPP_NAME,SUPP_CITY, SUPP_PHONE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'Rajesh Retails', 'Delhi',  1234567890),
       (2,'Appario Ltd.', 'Mumbai',2589631470),
       (3,'Knome products','Bangalore', 9785462315),
       (4,'Bansal Retails', 'Kochi', 8975463285),
       (5,'Mittal Ltd.', 'Lucknow', 7898456532)]
cursorObject.executemany(insert_supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [7]:
# insert into "customer" table
insert_customer = """INSERT INTO customer (CUS_ID , CUS_NAME, CUS_PHONE,CUS_CITY, CUS_GENDER) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [(1,'AAKASH', 9999999999, 'DELHI', 'M'),
       (2,'AMAN', 9785463215, 'NOIDA', 'M'),
       (3,'NEHA', 9999999998,'MUMBAI' ,'F'),
       (4,'MEGHA', 9994562399,'KOLKATA','F'),
       (5,'PULKIT',7895999999, 'LUCKNOW','M')]
cursorObject.executemany(insert_customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [8]:
# insert into "categoty" table
insert_category = """INSERT INTO category (CAT_ID , CAT_NAME) 
                       VALUES (%s, %s)"""

val = [(1,'BOOKS'),
       (2,'GAMES'),
       (3,'GROCERIES'),
       (4,'ELECTRONICS'),
       (5,'CLOTHES')]
cursorObject.executemany(insert_category, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [9]:
# insert into "product" table
insert_product = """INSERT INTO product (PRO_ID ,PRO_NAME, PRO_DESC, CAT_ID) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
       (2,'TSHIRT', 'DFDFJDFJDKFD', 5),
       (3,'ROG LAPTOP', ' DFNTTNTNTERND', 4),
       (4,' OATS', 'REURENTBTOTH',3),
       (5,'HARRY POTTER', 'NBEMCTHTJTH', 1)]
cursorObject.executemany(insert_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [10]:
# insert into "product_details" table
insert_product_details = """INSERT INTO product_details ( PROD_ID , PRO_ID, SUPP_ID , PROD_PRICE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000 )]
cursorObject.executemany(insert_product_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [11]:
# insert into "orders" table
insert_order = """INSERT INTO `order` (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) 
                             VALUES (%s, %s, %s, %s, %s)"""

val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]
   
cursorObject.executemany(insert_order, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [12]:
# insert into "rating" table
insert_rating = """INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) 
                             VALUES (%s, %s, %s, %s)"""

val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]
   
cursorObject.executemany(insert_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [13]:
question3 = """  select count(cust.cus_id) cust_count,cust.cus_gender
                    from e_commerce.Customer cust
                   inner join  e_commerce.order ord
                      on cust.cus_id = ord.cus_id
                   where ord.ord_amount >=3000
                   group by cust.cus_gender """

cursorObject.execute(question3)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Customer Count','Gender'])
output_df

   Customer Count Gender
0               1      M
1               1      F

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [14]:
question4 = """  select pro.PRO_NAME, ord.ORD_ID, ord.ORD_AMOUNT, ord.ORD_DATE
                    from e_commerce.order ord
                   inner join e_commerce.product_details prod
                      on ord.prod_id = prod.prod_id
                   inner join e_commerce.product pro
                      on pro.pro_id = prod.pro_id
                   where ord.CUS_ID = 2 """

cursorObject.execute(question4)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Product Name','Order Id', 'Order Amount', 'Order Date'])
output_df

  Product Name  Order Id  Order Amount  Order Date
0        GTA V        50          2000  2021-10-06

### Q5) Display the Supplier details who can supply more than one product.

In [15]:
question5=""" select  s.SUPP_ID ,s.SUPP_NAME,s.SUPP_CITY,s.SUPP_PHONE from supplier s  inner join 
                 ( select pd.SUPP_ID from product_details pd group by 
                 SUPP_ID having count(SUPP_ID)>1) as c on s.SUPP_ID=c.SUPP_ID;';
             """

cursorObject.execute(question5)
 
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Supplier_Id','Supplier_Name','Supplier_City','Supplier_Phone'])
output_df

   Supplier_Id   Supplier_Name Supplier_City Supplier_Phone
0            1  Rajesh Retails         Delhi     1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [17]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     password ="9Navya@sharma",
                                     database = 'e_commerce')
 
cursorObject = connection.cursor()
question6 = """ select cat.cat_name
                   from e_commerce.Category cat
                        inner join e_commerce.product pro
                           on cat.cat_id = pro.cat_id
                        inner join e_commerce.product_details prod
                           on pro.pro_id = prod.pro_id
                  where prod.PROD_ID in (select prod_id
                                           from e_commerce.order
                                          where ord_amount = (select min(ord_amount)
                                                                from e_commerce.order)
                        )"""

cursorObject.execute(question6)

output = cursorObject.fetchall()


output_df = pd.DataFrame(output, columns=['Category Name'])
output_df

  Category Name
0     GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [18]:
question7 = """  select pro.pro_id,pro.pro_name, ord.ord_date
                    from e_commerce.order ord
                   inner join e_commerce.product_details prod
                      on ord.prod_id = prod.prod_id
                   inner join e_commerce.product pro
                      on pro.pro_id = prod.pro_id
                   where ord.ord_date > "2021-10-05"
                   order by pro_id"""

cursorObject.execute(question7)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Product Id','Product Name','Order Date'])
output_df

   Product Id Product Name  Order Date
0           1        GTA V  2021-10-06
1           4         OATS  2021-10-12

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [19]:
question8 = """  select sup.supp_id,sup.supp_name,rate.rat_ratstars,cust.cus_name
                    from (select *
                          from e_commerce.rating
                         order by rat_ratstars desc limit 3) rate
                   inner join e_commerce.Supplier sup
                      on rate.supp_id = sup.supp_id
                   inner join e_commerce.Customer cust
                      on rate.cus_id = cust.cus_id"""

cursorObject.execute(question8)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Supplier Id','Supplier Name','Rating','Customer Name'])
output_df

   Supplier Id   Supplier Name  Rating Customer Name
0            1  Rajesh Retails       5        PULKIT
1            2    Appario Ltd.       4          AMAN
2            5     Mittal Ltd.       4         MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [20]:
question9 = """  select cus_name, cus_gender
                    from Customer cust
                   where cus_name like 'A%' or  cus_name like '%A'"""

cursorObject.execute(question9)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Customer Name','Gender'])
output_df

  Customer Name Gender
0        AAKASH      M
1          AMAN      M
2          NEHA      F
3         MEGHA      F

### Q10) Display the total order amount of the male customers.

In [21]:
question10 = """ select sum(ord.ord_amount) "Total Ordered Amount"
                    from e_commerce.order ord
                   inner join e_commerce.Customer cust
                      on cust.cus_id = ord.cus_id
                   where cust.cus_gender = 'M'"""

cursorObject.execute(question10)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Total Ordered Amount'])
output_df

  Total Ordered Amount
0                34500

### Q11) Display all the Customers left outer join with  the orders

In [22]:
question11 = """ select cust.CUS_ID, cust.cus_name, cust.cus_phone, cust.cus_city, cust.cus_gender
                    from e_commerce.Customer cust
                    left outer join e_commerce.order ord
                      on cust.cus_id = ord.cus_id"""

cursorObject.execute(question11)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['Customer Id','Customer Name','Customer Phone','Customer City','Gender'])
output_df

   Customer Id Customer Name Customer Phone Customer City Gender
0            1        AAKASH     9999999999         DELHI      M
1            2          AMAN     9785463215         NOIDA      M
2            3          NEHA     9999999998        MUMBAI      F
3            4         MEGHA     9994562399       KOLKATA      F
4            5        PULKIT     7895999999       LUCKNOW      M

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)